metaneutrons/rumiga/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# D1001 hardware baseline, independently reproduced from the audited Vellum
# bring-up revision recorded in toolchain/manifest.toml.
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# The table sits at 0x10000 so the bootloader has a 56 KiB window; the stock
# 0x8000 offset leaves 480 bytes and cannot hold a Secure Boot V2 signature.
#
# The product layout lives in `firmware/partitions.csv` and is applied when the
# flashable image is generated. `esp-idf-sys` documents that a custom table in
# `sdkconfig.defaults` is ignored by its generated CMake project, so the table
# the ESP-IDF build emits is a build artifact and not the shipped layout.
CONFIG_PARTITION_TABLE_OFFSET=0x10000
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# Flash encryption in Development mode. Release mode permanently removes plaintext
# ROM-download flashing and therefore the cable as a recovery path, so it is
# deliberately deferred until the recovery path is decided.
#
# EFUSE_VIRTUAL keeps this pre-hardware phase from burning eFuses on the first
# board that boots this firmware. It also makes Release mode unselectable, because
# SECURE_FLASH_ENCRYPTION_MODE_RELEASE depends on !EFUSE_VIRTUAL, so a production
# image cannot be produced by accident. Both settings change together with the
# first hardware bring-up.
CONFIG_SECURE_FLASH_ENC_ENABLED=y
CONFIG_SECURE_FLASH_ENCRYPTION_MODE_DEVELOPMENT=y
CONFIG_EFUSE_VIRTUAL=y

# Flash encryption implies NVS encryption. ESP-IDF defaults to the HMAC scheme on
# SoCs with an HMAC peripheral, whose eFuse key ID defaults to -1 and fails the
# build. The flash-encryption scheme instead uses the `nvs_keys` partition the
# layout already reserves and consumes no eFuse key block, which keeps blocks free
# for the flash-encryption key and Secure Boot digests. Switching to HMAC later is
# a configuration change and burns one key block; it moves no partition.
CONFIG_NVS_SEC_KEY_PROTECT_USING_FLASH_ENC=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# PSRAM allocator policy. Declared in toolchain/manifest.toml [boot_policy] and verified
# against the resolved sdkconfig by the firmware gate. Allocations at or below the
# always-internal threshold come from internal RAM; the reserve keeps internal RAM
# available to callers that require it once PSRAM is in the general heap.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=8192
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_400=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# Panic policy. Print and reboot without delay. An appliance that halts at a prompt nobody
# reads is indistinguishable from a dead one, so diagnosis comes from the core dump.
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS=0

# Core dumps to flash. M2-013 reserved a 108 KiB `coredump` partition, and ESP-IDF defaults
# core dumps off, so nothing ever wrote to it. The partition also carries the `encrypted`
# flag in firmware/partitions.csv: ESP-IDF writes the dump in plain text and only logs a
# warning when flash encryption is on and that flag is absent, and a dump contains task
# stacks.
#
# DRAM capture stays off deliberately. ESP-IDF states that enabling it needs at least
# 128 KiB reserved and the partition is 108 KiB, and the layout is effectively permanent
# once devices ship. Task stacks fit.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
# CONFIG_ESP_COREDUMP_CAPTURE_DRAM is not set
CONFIG_ESP_COREDUMP_CHECK_BOOT=y
CONFIG_ESP_COREDUMP_MAX_TASKS_NUM=64

# Watchdog policy. The task watchdog panics, and therefore reboots, on timeout, because a
# hung device that recovers itself beats one that stays hung. Both idle tasks stay
# subscribed, so this trips on any task that monopolizes a core without yielding. The
# emulator frame loop must yield or subscribe itself and feed the watchdog; ADR-0021
# records that obligation rather than granting a pass by unsubscribing an idle task.
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y
CONFIG_ESP_INT_WDT=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=300
CONFIG_BOOTLOADER_WDT_ENABLE=y
CONFIG_BOOTLOADER_WDT_TIME_MS=9000

# Logging policy. Default INFO, with DEBUG compiled in so field diagnosis can be raised at
# runtime without a new image. VERBOSE stays out; it is compiled per call site and the gain
# over DEBUG does not justify the size on a device that cannot be reflashed casually.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
